zephyrproject-rtos/hal_espressif/zephyr/esp32s3/src/bt/esp_bt_adapter.c
/*
 * SPDX-FileCopyrightText: 2015-2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stddef.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

#include "sdkconfig.h"
#include "esp_types.h"
#include "esp_mac.h"
#include "esp_random.h"
#include "esp_attr.h"
#include "esp_phy_init.h"
#include "esp_bt.h"
#include "esp_err.h"
#include "esp_cpu.h"
#include "esp_private/periph_ctrl.h"
#include "esp_private/esp_clk.h"
#include "soc/soc_caps.h"
#include "soc/rtc.h"
#include "soc/rtc_cntl_reg.h"
#include "soc/soc_memory_layout.h"
#include "private/esp_coexist_internal.h"
#include "esp_timer.h"
#include "esp_sleep.h"
#include "esp_heap_adapter.h"
#include "esp_rom_sys.h"
#include "esp_private/phy.h"

#include <zephyr/kernel.h>
#include <zephyr/sys/printk.h>
#include <zephyr/random/random.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(esp32_bt_adapter, CONFIG_LOG_DEFAULT_LEVEL);

#define BTDM_INIT_PERIOD (5000) /* ms */

/* Low Power Clock Selection */
#define BTDM_LPCLK_SEL_XTAL      (0)
#define BTDM_LPCLK_SEL_XTAL32K   (1)
#define BTDM_LPCLK_SEL_RTC_SLOW  (2)
#define BTDM_LPCLK_SEL_8M        (3)

// wakeup request sources
enum {
	BTDM_ASYNC_WAKEUP_SRC_VHCI = 0,
	BTDM_ASYNC_WAKEUP_REQ_COEX,
	BTDM_ASYNC_WAKEUP_SRC_DISA,
	BTDM_ASYNC_WAKEUP_SRC_TMR,
	BTDM_ASYNC_WAKEUP_SRC_MAX,
};

// low power control struct
typedef union {
	struct {
		uint32_t enable                  :  1; // whether low power mode is required
		uint32_t lpclk_sel               :  3; // low power clock source
		uint32_t mac_bb_pd               :  1; // whether hardware(MAC, BB) force-power-down is required during sleep
		uint32_t wakeup_timer_required   :  1; // whether system timer is needed
		uint32_t no_light_sleep          :  1; // do not allow system to enter light sleep after bluetooth is enabled
		uint32_t main_xtal_pu            :  1; // power up main XTAL
		uint32_t reserved                : 24; // reserved
	};
	uint32_t val;
} btdm_lpcntl_t;

// low power control status
typedef union {
	struct {
		uint32_t pm_lock_released        :  1; // whether power management lock is released
		uint32_t mac_bb_pd               :  1; // whether hardware(MAC, BB) is powered down
		uint32_t phy_enabled             :  1; // whether phy is switched on
		uint32_t wakeup_timer_started    :  1; // whether wakeup timer is started
		uint32_t reserved                : 28; // reserved
	};
	uint32_t val;
} btdm_lpstat_t;

/* Sleep and wakeup interval control */
#define BTDM_MIN_SLEEP_DURATION          (24) // threshold of interval in half slots to allow to fall into modem sleep
#define BTDM_MODEM_WAKE_UP_DELAY         (8)  // delay in half slots of modem wake up procedure, including re-enable PHY/RF

#define OSI_FUNCS_TIME_BLOCKING  0xffffffff
#define OSI_VERSION              0x00010009
#define OSI_MAGIC_VALUE          0xFADEBEAD

#define BLE_PWR_HDL_INVL 0xFFFF

/* VHCI function interface */
typedef struct vhci_host_callback {
	/* callback used to notify that the host can send packet to controller */
	void (*notify_host_send_available)(void);
	/* callback used to notify that the controller has a packet to send to the host */
	int (*notify_host_recv)(uint8_t *data, uint16_t len);
} vhci_host_callback_t;

/* bt queue */
struct bt_queue_t {
	struct k_msgq queue;
	void *pool;
};

typedef void (* osi_intr_handler)(void);

typedef struct {
	int source;               /*!< ISR source */
	int flags;                /*!< ISR alloc flag */
	void (*fn)(void *);       /*!< ISR function */
	void *arg;                /*!< ISR function args*/
	struct intr_handle_data_t *handle;    /*!< ISR handle */
	esp_err_t ret;
} btdm_isr_alloc_t;

/* OSI function */
struct osi_funcs_t {
	uint32_t _magic;
	uint32_t _version;
	int (* _interrupt_alloc)(int cpu_id, int source, intr_handler_t handler, void *arg, void **ret_handle);
	int (* _interrupt_free)(void *handle);
	void (*_interrupt_handler_set_rsv)(int interrupt_no, intr_handler_t fn, void *arg);
	void (*_global_intr_disable)(void);
	void (*_global_intr_restore)(void);
	void (*_task_yield)(void);
	void (*_task_yield_from_isr)(void);
	void *(*_semphr_create)(uint32_t max, uint32_t init);
	void (*_semphr_delete)(void *semphr);
	int (*_semphr_take_from_isr)(void *semphr, void *hptw);
	int (*_semphr_give_from_isr)(void *semphr, void *hptw);
	int (*_semphr_take)(void *semphr, uint32_t block_time_ms);
	int (*_semphr_give)(void *semphr);
	void *(*_mutex_create)(void);
	void (*_mutex_delete)(void *mutex);
	int (*_mutex_lock)(void *mutex);
	int (*_mutex_unlock)(void *mutex);
	void *(* _queue_create)(uint32_t queue_len, uint32_t item_size);
	void (* _queue_delete)(void *queue);
	int (* _queue_send)(void *queue, void *item, uint32_t block_time_ms);
	int (* _queue_send_from_isr)(void *queue, void *item, void *hptw);
	int (* _queue_recv)(void *queue, void *item, uint32_t block_time_ms);
	int (* _queue_recv_from_isr)(void *queue, void *item, void *hptw);
	int (* _task_create)(void *task_func, const char *name, uint32_t stack_depth, void *param, uint32_t prio, void *task_handle, uint32_t core_id);
	void (* _task_delete)(void *task_handle);
	bool (* _is_in_isr)(void);
	int (* _cause_sw_intr_to_core)(int core_id, int intr_no);
	void *(* _malloc)(size_t size);
	void *(* _malloc_internal)(size_t size);
	void (* _free)(void *p);
	int (* _read_efuse_mac)(uint8_t mac[6]);
	void (* _srand)(unsigned int seed);
	int (* _rand)(void);
	uint32_t (* _btdm_lpcycles_2_hus)(uint32_t cycles, uint32_t *error_corr);
	uint32_t (* _btdm_hus_2_lpcycles)(uint32_t hus);
	bool (* _btdm_sleep_check_duration)(int32_t *slot_cnt);
	void (* _btdm_sleep_enter_phase1)(uint32_t lpcycles);  /* called when interrupt is disabled */
	void (* _btdm_sleep_enter_phase2)(void);
	void (* _btdm_sleep_exit_phase1)(void);  /* called from ISR */
	void (* _btdm_sleep_exit_phase2)(void);  /* called from ISR */
	void (* _btdm_sleep_exit_phase3)(void);  /* called from task */
	void (* _coex_wifi_sleep_set)(bool sleep);
	int (* _coex_core_ble_conn_dyn_prio_get)(bool *low, bool *high);
	int (* _coex_schm_register_btdm_callback)(void *callback);
	void (* _coex_schm_status_bit_set)(uint32_t type, uint32_t status);
	void (* _coex_schm_status_bit_clear)(uint32_t type, uint32_t status);
	uint32_t (* _coex_schm_interval_get)(void);
	uint8_t (* _coex_schm_curr_period_get)(void);
	void *(* _coex_schm_curr_phase_get)(void);
	int (* _interrupt_enable)(void *handle);
	int (* _interrupt_disable)(void *handle);
	void (* _esp_hw_power_down)(void);
	void (* _esp_hw_power_up)(void);
	void (* _ets_backup_dma_copy)(uint32_t reg, uint32_t mem_addr, uint32_t num, bool to_rem);
	void (* _ets_delay_us)(uint32_t us);
	void (* _btdm_rom_table_ready)(void);
	bool (* _coex_bt_wakeup_request)(void);
	void (* _coex_bt_wakeup_request_end)(void);
};

/* not for user call, so don't put to include file */
/* OSI */
extern int btdm_osi_funcs_register(void *osi_funcs);
/* Initialise and De-initialise */
extern int btdm_controller_init(esp_bt_controller_config_t *config_opts);
extern void btdm_controller_deinit(void);
extern int btdm_controller_enable(esp_bt_mode_t mode);
extern void btdm_controller_disable(void);
extern uint8_t btdm_controller_get_mode(void);
extern const char *btdm_controller_get_compile_version(void);
extern void btdm_rf_bb_init_phase2(void); // shall be called after PHY/RF is enabled

/* Sleep */
extern void btdm_controller_enable_sleep(bool enable);
extern uint8_t btdm_controller_get_sleep_mode(void);
extern bool btdm_power_state_active(void);
extern void btdm_wakeup_request(void);
extern void btdm_in_wakeup_requesting_set(bool in_wakeup_requesting);

/* vendor dependent tasks to be posted and handled by controller task*/
extern int btdm_vnd_offload_task_register(btdm_vnd_ol_sig_t sig, btdm_vnd_ol_task_func_t func);
extern int btdm_vnd_offload_task_deregister(btdm_vnd_ol_sig_t sig);
extern int r_btdm_vnd_offload_post_from_isr(btdm_vnd_ol_sig_t sig, void *param, bool need_yield);
extern int r_btdm_vnd_offload_post(btdm_vnd_ol_sig_t sig, void *param);

