zephyrproject-rtos/hal_espressif/zephyr/esp32s3/src/bt/esp_bt_adapter.c
	if (block_time_ms == OSI_FUNCS_TIME_BLOCKING) {
		res = k_msgq_put(queue, item, K_FOREVER);
	} else {
		res = k_msgq_put(queue, item, K_MSEC(block_time_ms));
	}

	if (res == 0) {
		return 1;
	}

	return 0;
}

static int32_t IRAM_ATTR queue_send_from_isr_wrapper(void *queue, void *item, void *hptw)
{
	int *hpt = (int *) hptw;
	int ret = k_msgq_put(queue, item, K_NO_WAIT);

	*hpt = 0;

	if (ret == 0) {
		return 1;
	}

	return 0;
}

static int32_t queue_recv_wrapper(void *queue, void *item, uint32_t block_time_ms)
{
	int ret = 0;

	if (block_time_ms == OSI_FUNCS_TIME_BLOCKING) {
		ret = k_msgq_get(queue, item, K_FOREVER);
	} else {
		ret = k_msgq_get(queue, item, K_MSEC(block_time_ms));
	}

	if (ret == 0) {
		return 1;
	}

	return 0;
}

static int32_t IRAM_ATTR queue_recv_from_isr_wrapper(void *queue, void *item, void *hptw)
{
	int *hpt = (int *) hptw;
	int ret = k_msgq_get(queue, item, K_NO_WAIT);

	*hpt = 0;

	if (ret == 0) {
		return 1;
	}

	return 0;
}

static int32_t task_create_wrapper(void *task_func, const char *name, uint32_t stack_depth, void *param, uint32_t prio, void *task_handle, uint32_t core_id)
{
	k_tid_t tid = k_thread_create(&bt_task_handle, bt_stack, stack_depth,
				      (k_thread_entry_t)task_func, param, NULL, NULL,
				      K_PRIO_COOP(prio), K_INHERIT_PERMS, K_NO_WAIT);

	k_thread_name_set(tid, name);

	*(int32_t *)task_handle = (int32_t) tid;

	return 1;
}

static void task_delete_wrapper(void *task_handle)
{
	if (task_handle != NULL) {
		k_thread_abort((k_tid_t)task_handle);
	}

	k_object_release(&bt_task_handle);
}

static void *malloc_internal_wrapper(size_t size)
{
	return esp_bt_malloc_func(sizeof(uint8_t) * size);
}

static int32_t IRAM_ATTR read_mac_wrapper(uint8_t mac[6])
{
	return esp_read_mac(mac, ESP_MAC_BT);
}

static int IRAM_ATTR rand_wrapper(void)
{
	return (int)esp_random();
}

static void IRAM_ATTR srand_wrapper(unsigned int seed)
{
	/* empty function */
	ARG_UNUSED(seed);
}

static uint32_t IRAM_ATTR btdm_lpcycles_2_hus(uint32_t cycles, uint32_t *error_corr)
{
	uint64_t local_error_corr = (error_corr == NULL) ? 0 : (uint64_t)(*error_corr);
	uint64_t res = (uint64_t)btdm_lpcycle_us * cycles * 2;
	local_error_corr += res;
	res = (local_error_corr >> btdm_lpcycle_us_frac);
	local_error_corr -= (res << btdm_lpcycle_us_frac);
	if (error_corr) {
			*error_corr = (uint32_t) local_error_corr;
	}
	return (uint32_t)res;
}

/*
 * @brief Converts a duration in half us into a number of low power clock cycles.
 */
static uint32_t IRAM_ATTR btdm_hus_2_lpcycles(uint32_t hus)
{
	/* The number of sleep duration(us) should not lead to overflow. Thrs: 100s
	 * Compute the sleep duration in us to low power clock cycles, with calibration result applied
	 * clock measurement is conducted
	 */
	uint64_t cycles = ((uint64_t)(hus) << btdm_lpcycle_us_frac) / btdm_lpcycle_us;
	cycles >>= 1;

	return (uint32_t)cycles;
}

static bool IRAM_ATTR btdm_sleep_check_duration(int32_t *half_slot_cnt)
{
	if (*half_slot_cnt < BTDM_MIN_SLEEP_DURATION) {
		return false;
	}
	/* wake up in advance considering the delay in enabling PHY/RF */
	*half_slot_cnt -= BTDM_MODEM_WAKE_UP_DELAY;
	return true;
}

static void btdm_sleep_enter_phase1_wrapper(uint32_t lpcycles)
{
	if (s_lp_cntl.wakeup_timer_required == 0) {
		return;
	}

	// start a timer to wake up and acquire the pm_lock before modem_sleep awakes
	uint32_t us_to_sleep = btdm_lpcycles_2_hus(lpcycles, NULL) >> 1;

#define BTDM_MIN_TIMER_UNCERTAINTY_US      (1800)
	assert(us_to_sleep > BTDM_MIN_TIMER_UNCERTAINTY_US);
	// allow a maximum time uncertainty to be about 488ppm(1/2048) at least as clock drift
	// and set the timer in advance
	uint32_t uncertainty = (us_to_sleep >> 11);
	if (uncertainty < BTDM_MIN_TIMER_UNCERTAINTY_US) {
		uncertainty = BTDM_MIN_TIMER_UNCERTAINTY_US;
	}

	assert (s_lp_stat.wakeup_timer_started == 0);
	if (esp_timer_start_once(s_btdm_slp_tmr, us_to_sleep - uncertainty) == ESP_OK) {
		s_lp_stat.wakeup_timer_started = 1;
	} else {
		LOG_ERR("timer start failed");
		assert(0);
	}
}

static void btdm_sleep_enter_phase2_wrapper(void)
{
	if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1) {
		if (s_lp_stat.phy_enabled) {
			esp_phy_disable(PHY_MODEM_BT);
			s_lp_stat.phy_enabled = 0;
		} else {
			assert(0);
		}
	}
}

static void btdm_sleep_exit_phase3_wrapper(void)
{
	if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1) {
		if (s_lp_stat.phy_enabled == 0) {
			esp_phy_enable(PHY_MODEM_BT);
			s_lp_stat.phy_enabled = 1;
		}
	}

	// If BT wakeup before esp timer coming due to timer task have no chance to run.
	// Then we will not run into `btdm_sleep_exit_phase0` and stop esp timer,
	// Do it again here to fix this issue.
	if (s_lp_cntl.wakeup_timer_required && s_lp_stat.wakeup_timer_started) {
		esp_timer_stop(s_btdm_slp_tmr);
		s_lp_stat.wakeup_timer_started = 0;
	}

	// wait for the sleep state to change
	// the procedure duration is at micro-second level or less
	while (btdm_sleep_clock_sync()) {
		;
	}
}

static void IRAM_ATTR btdm_sleep_exit_phase0(void *param)
{
	assert(s_lp_cntl.enable == 1);

	int event = (int) param;
	if (event == BTDM_ASYNC_WAKEUP_SRC_VHCI || event == BTDM_ASYNC_WAKEUP_SRC_DISA) {
		btdm_wakeup_request();
	}

	if (s_lp_cntl.wakeup_timer_required && s_lp_stat.wakeup_timer_started) {
		esp_timer_stop(s_btdm_slp_tmr);
		s_lp_stat.wakeup_timer_started = 0;
	}

	if (event == BTDM_ASYNC_WAKEUP_SRC_VHCI || event == BTDM_ASYNC_WAKEUP_SRC_DISA) {
		semphr_give_wrapper(s_wakeup_req_sem);
	}
}

static void IRAM_ATTR btdm_slp_tmr_callback(void *arg)
{
}

static bool async_wakeup_request(int event)
{
	if (s_lp_cntl.enable == 0) {
		return false;
	}

	bool do_wakeup_request = false;
	switch (event) {
		case BTDM_ASYNC_WAKEUP_SRC_VHCI:
		case BTDM_ASYNC_WAKEUP_SRC_DISA:
			btdm_in_wakeup_requesting_set(true);
			if (!btdm_power_state_active()) {
				r_btdm_vnd_offload_post(BTDM_VND_OL_SIG_WAKEUP_TMR, (void *)event);
				do_wakeup_request = true;
				semphr_take_wrapper(s_wakeup_req_sem, OSI_FUNCS_TIME_BLOCKING);
			}
			break;
		case BTDM_ASYNC_WAKEUP_REQ_COEX:
			if (!btdm_power_state_active()) {
				do_wakeup_request = true;
				btdm_wakeup_request();
				if (s_lp_cntl.wakeup_timer_required && s_lp_stat.wakeup_timer_started) {
					esp_timer_stop(s_btdm_slp_tmr);
					s_lp_stat.wakeup_timer_started = 0;
				}
			}
		default:
			break;
	}

	return do_wakeup_request;
}

