zephyrproject-rtos/hal_espressif/zephyr/esp32s3/src/bt/esp_bt_adapter.c
static void async_wakeup_request_end(int event)
{
	if (s_lp_cntl.enable == 0) {
		return;
	}

	bool allow_to_sleep;
	switch (event) {
		case BTDM_ASYNC_WAKEUP_SRC_VHCI:
		case BTDM_ASYNC_WAKEUP_SRC_DISA:
			allow_to_sleep = true;
			break;
		case BTDM_ASYNC_WAKEUP_REQ_COEX:
			allow_to_sleep = false;
			break;
		default:
			allow_to_sleep = true;
			break;
	}

	if (allow_to_sleep) {
		btdm_in_wakeup_requesting_set(false);
	}

	return;
}

static int coex_schm_register_btdm_callback_wrapper(void *callback)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_register_callback(COEX_SCHM_CALLBACK_TYPE_BT, callback);
#else
	return 0;
#endif
}

static void coex_schm_status_bit_clear_wrapper(uint32_t type, uint32_t status)
{
#if CONFIG_SW_COEXIST_ENABLE
	coex_schm_status_bit_clear(type, status);
#endif
}

static void coex_schm_status_bit_set_wrapper(uint32_t type, uint32_t status)
{
#if CONFIG_SW_COEXIST_ENABLE
	coex_schm_status_bit_set(type, status);
#endif
}

static void btdm_funcs_table_ready_wrapper(void)
{
#if BT_BLE_CCA_MODE == 2
	btdm_cca_feature_enable();
#endif
#if BLE_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS_ENABLED
	btdm_aa_check_enhance_enable();
#endif
}

bool bt_async_wakeup_request(void)
{
	return async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_VHCI);
}

void bt_wakeup_request_end(void)
{
	async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_VHCI);
}

static bool coex_bt_wakeup_request(void)
{
	return async_wakeup_request(BTDM_ASYNC_WAKEUP_REQ_COEX);
}

static void coex_bt_wakeup_request_end(void)
{
	async_wakeup_request_end(BTDM_ASYNC_WAKEUP_REQ_COEX);
	return;
}

bool esp_vhci_host_check_send_available(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return false;
	}
	return API_vhci_host_check_send_available();
}

void esp_vhci_host_send_packet(uint8_t *data, uint16_t len)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return;
	}
	async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_VHCI);

	API_vhci_host_send_packet(data, len);

	async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_VHCI);
}

esp_err_t esp_vhci_host_register_callback(const esp_vhci_host_callback_t *callback)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_FAIL;
	}

	return API_vhci_host_register_callback((const esp_vhci_host_callback_t *)callback) == 0 ? ESP_OK : ESP_FAIL;
}


static void btdm_controller_mem_init(void)
{
	extern void btdm_controller_rom_data_init(void );
	btdm_controller_rom_data_init();
}

esp_err_t esp_bt_controller_mem_release(esp_bt_mode_t mode)
{
	LOG_WRN("%s not implemented, return OK", __func__);
	return ESP_OK;
}

esp_err_t esp_bt_mem_release(esp_bt_mode_t mode)
{
	LOG_WRN("%s not implemented, return OK", __func__);
	return ESP_OK;
}

#if CONFIG_MAC_BB_PD
static void IRAM_ATTR btdm_mac_bb_power_down_cb(void)
{
	if (s_lp_cntl.mac_bb_pd && s_lp_stat.mac_bb_pd == 0) {
		btdm_ble_power_down_dma_copy(true);
		s_lp_stat.mac_bb_pd = 1;
	}
}

static void IRAM_ATTR btdm_mac_bb_power_up_cb(void)
{
	if (s_lp_cntl.mac_bb_pd && s_lp_stat.mac_bb_pd) {
		btdm_ble_power_down_dma_copy(false);
		s_lp_stat.mac_bb_pd = 0;
	}
}
#endif

// init low-power control resources
static esp_err_t btdm_low_power_mode_init(esp_bt_controller_config_t *cfg)
{
	esp_err_t err = ESP_OK;

	do {
		// set default values for global states or resources
		s_lp_stat.val = 0;
		s_lp_cntl.val = 0;
		s_lp_cntl.main_xtal_pu = 0;
		s_wakeup_req_sem = NULL;
		s_btdm_slp_tmr = NULL;

		// configure and initialize resources
		s_lp_cntl.enable = (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1) ? 1 : 0;
		s_lp_cntl.lpclk_sel = (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1) ? cfg->sleep_clock : ESP_BT_SLEEP_CLOCK_MAIN_XTAL;
		s_lp_cntl.no_light_sleep = 0;

		if (s_lp_cntl.enable) {
#if CONFIG_MAC_BB_PD
			if (!btdm_deep_sleep_mem_init()) {
				err = ESP_ERR_NO_MEM;
				break;
			}
			s_lp_cntl.mac_bb_pd = 1;
#endif
			// async wakeup semaphore for VHCI
			s_wakeup_req_sem = semphr_create_wrapper(1, 0);
			if (s_wakeup_req_sem == NULL) {
				err = ESP_ERR_NO_MEM;
				break;
			}
			btdm_vnd_offload_task_register(BTDM_VND_OL_SIG_WAKEUP_TMR, btdm_sleep_exit_phase0);

			if (s_lp_cntl.wakeup_timer_required) {
				esp_timer_create_args_t create_args = {
					.callback = btdm_slp_tmr_callback,
					.arg = NULL,
					.name = "btSlp",
				};
				if ((err = esp_timer_create(&create_args, &s_btdm_slp_tmr)) != ESP_OK) {
					break;
				}
			}

			// set default bluetooth sleep clock cycle and its fractional bits
			btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
			btdm_lpcycle_us = 2 << (btdm_lpcycle_us_frac);

			if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_EXT_32K_XTAL) { // External 32 kHz XTAL
				// check whether or not EXT_CRYS is working
				if (rtc_clk_slow_src_get() != SOC_RTC_SLOW_CLK_SRC_XTAL32K) {
					LOG_WRN("32.768kHz XTAL not detected, fall back to main XTAL as Bluetooth sleep clock");
					s_lp_cntl.lpclk_sel = ESP_BT_SLEEP_CLOCK_MAIN_XTAL;
#if !CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
					s_lp_cntl.no_light_sleep = 1;
#endif
				}
			} else if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_RTC_SLOW) {  // Internal 136kHz RC oscillator
				if (rtc_clk_slow_src_get() == SOC_RTC_SLOW_CLK_SRC_RC_SLOW) {
					LOG_WRN("Internal 136kHz RC oscillator. The accuracy of this clock is a lot larger than 500ppm which is "
								"required in Bluetooth communication, so don't select this option in scenarios such as BLE connection state.");
				} else {
					LOG_WRN("Internal 136kHz RC oscillator not detected.");
					assert(0);
				}
			} else if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL) {
				LOG_INF("Bluetooth will use main XTAL as Bluetooth sleep clock.");
#if !CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
				s_lp_cntl.no_light_sleep = 1;
#endif
			}
		} else {
			s_lp_cntl.no_light_sleep = 1;
		}

		bool select_src_ret __attribute__((unused));
		bool set_div_ret __attribute__((unused));
		if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL) {
#ifdef CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
			esp_sleep_pd_config(ESP_PD_DOMAIN_XTAL, ESP_PD_OPTION_ON);
			s_lp_cntl.main_xtal_pu = 1;
#endif
			select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL);
			set_div_ret = btdm_lpclk_set_div(esp_clk_xtal_freq() / MHZ(1));
			assert(select_src_ret && set_div_ret);
			btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
			btdm_lpcycle_us = 1 << (btdm_lpcycle_us_frac);
		} else if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_EXT_32K_XTAL) {
			select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL32K);
			set_div_ret = btdm_lpclk_set_div(0);
			assert(select_src_ret && set_div_ret);
			btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
			btdm_lpcycle_us = (RTC_CLK_CAL_FRACT > 15) ? (1000000 << (RTC_CLK_CAL_FRACT - 15)) :
				(1000000 >> (15 - RTC_CLK_CAL_FRACT));
			assert(btdm_lpcycle_us != 0);
		} else if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_RTC_SLOW) {
			select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_RTC_SLOW);
			set_div_ret = btdm_lpclk_set_div(0);
			assert(select_src_ret && set_div_ret);
			btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
			btdm_lpcycle_us = esp_clk_slowclk_cal_get();
		} else {
			err = ESP_ERR_INVALID_ARG;
			break;
		}
#if CONFIG_SW_COEXIST_ENABLE
		coex_update_lpclk_interval();
#endif

	} while (0);

