zephyrproject-rtos/hal_espressif/zephyr/esp32s3/src/bt/esp_bt_adapter.c
	return err;
}

esp_bt_sleep_clock_t esp_bt_get_lpclk_src(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED &&
			btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_BT_SLEEP_CLOCK_NONE;
	}

	return s_lp_cntl.lpclk_sel;
}

esp_err_t esp_bt_controller_init(esp_bt_controller_config_t *cfg)
{
	esp_err_t err = ESP_FAIL;

	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE) {
		return ESP_ERR_INVALID_STATE;
	}

	if (cfg == NULL) {
		return ESP_ERR_INVALID_ARG;
	}

	if (cfg->controller_task_prio != CONFIG_ESP32_BT_CONTROLLER_TASK_PRIO
		|| cfg->controller_task_stack_size < CONFIG_ESP32_BT_CONTROLLER_STACK_SIZE) {
		LOG_ERR("Invalid controller task prioriy or stack size");
		return ESP_ERR_INVALID_ARG;
	}

	if (cfg->bluetooth_mode != ESP_BT_MODE_BLE) {
		LOG_ERR("%s controller only support BLE only mode", __func__);
		return ESP_ERR_NOT_SUPPORTED;
	}

	if (cfg->bluetooth_mode & ESP_BT_MODE_BLE) {
		if ((cfg->ble_max_act <= 0) || (cfg->ble_max_act > BT_CTRL_BLE_MAX_ACT_LIMIT)) {
			LOG_ERR("Invalid value of ble_max_act");
			return ESP_ERR_INVALID_ARG;
		}
	}

	if (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1) {
		if (cfg->sleep_clock == ESP_BT_SLEEP_CLOCK_NONE) {
			LOG_ERR("SLEEP_MODE_1 enabled but sleep clock not configured");
			return ESP_ERR_INVALID_ARG;
		}
		if (cfg->sleep_clock > ESP_BT_SLEEP_CLOCK_RTC_SLOW) {
			LOG_ERR("SLEEP_MODE_1 is enabled but this sleep clock is not supported");
			return ESP_ERR_INVALID_ARG;
		}
	}

	// overwrite some parameters
	cfg->magic = ESP_BT_CTRL_CONFIG_MAGIC_VAL;

#if CONFIG_MAC_BB_PD
	esp_mac_bb_pd_mem_init();
#endif
	esp_phy_modem_init();
	esp_bt_power_domain_on();

	btdm_controller_mem_init();

	osi_funcs_p = (struct osi_funcs_t *)malloc_internal_wrapper(sizeof(struct osi_funcs_t));
	if (osi_funcs_p == NULL) {
		return ESP_ERR_NO_MEM;
	}

	memcpy(osi_funcs_p, &osi_funcs_ro, sizeof(struct osi_funcs_t));
	if (btdm_osi_funcs_register(osi_funcs_p) != 0) {
		return ESP_ERR_INVALID_ARG;
	}

	LOG_INF("BT controller compile version [%s]", btdm_controller_get_compile_version());

	if ((err = btdm_low_power_mode_init(cfg)) != ESP_OK) {
		LOG_ERR("Low power module initialization failed");
		goto error;
	}

#if CONFIG_SW_COEXIST_ENABLE
	coex_init();
#endif

	periph_module_enable(PERIPH_BT_MODULE);
	periph_module_reset(PERIPH_BT_MODULE);

	if (btdm_controller_init(cfg) != 0) {
		err = ESP_ERR_NO_MEM;
		goto error;
	}

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

	return ESP_OK;

error:

	bt_controller_deinit_internal();

	return err;
}

esp_err_t esp_bt_controller_deinit(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED) {
		return ESP_ERR_INVALID_STATE;
	}

	btdm_controller_deinit();

	bt_controller_deinit_internal();

	return ESP_OK;
}

// deinit low power control resources
static void btdm_low_power_mode_deinit(void)
{
#if CONFIG_MAC_BB_PD
	if (s_lp_cntl.mac_bb_pd) {
		btdm_deep_sleep_mem_deinit();
		s_lp_cntl.mac_bb_pd = 0;
	}
#endif

	if (s_lp_cntl.wakeup_timer_required && s_btdm_slp_tmr != NULL) {
		if (s_lp_stat.wakeup_timer_started) {
			esp_timer_stop(s_btdm_slp_tmr);
		}
		s_lp_stat.wakeup_timer_started = 0;
		esp_timer_delete(s_btdm_slp_tmr);
		s_btdm_slp_tmr = NULL;
	}

	if (s_lp_cntl.enable) {
		btdm_vnd_offload_task_deregister(BTDM_VND_OL_SIG_WAKEUP_TMR);
		if (s_wakeup_req_sem != NULL) {
			semphr_delete_wrapper(s_wakeup_req_sem);
			s_wakeup_req_sem = NULL;
		}
	}

	if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL) {
#ifdef CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
		if (s_lp_cntl.main_xtal_pu) {
			esp_sleep_pd_config(ESP_PD_DOMAIN_XTAL, ESP_PD_OPTION_OFF);
			s_lp_cntl.main_xtal_pu = 0;
		}
#endif
		btdm_lpclk_select_src(BTDM_LPCLK_SEL_RTC_SLOW);
		btdm_lpclk_set_div(0);
#if CONFIG_SW_COEXIST_ENABLE
		coex_update_lpclk_interval();
#endif
	}

	btdm_lpcycle_us = 0;
}

static void bt_controller_deinit_internal(void)
{
	periph_module_disable(PERIPH_BT_MODULE);

	btdm_low_power_mode_deinit();

	esp_bt_power_domain_off();
#if CONFIG_MAC_BB_PD
	esp_mac_bb_pd_mem_deinit();
#endif
	esp_phy_modem_deinit();
	if (osi_funcs_p != NULL) {
		esp_bt_free(osi_funcs_p);
		osi_funcs_p = NULL;
	}

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;
}

esp_err_t esp_bt_controller_enable(esp_bt_mode_t mode)
{
	int ret = ESP_OK;

	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED) {
		return ESP_ERR_INVALID_STATE;
	}

	/* As the history reason, mode should be equal to the mode which set in esp_bt_controller_init() */
	if (mode != btdm_controller_get_mode()) {
		return ESP_ERR_INVALID_ARG;
	}

	/* Enable PHY when enabling controller to reduce power dissipation after controller init
	 * Notice the init order: esp_phy_enable() -> bt_bb_v2_init_cmplx() -> coex_pti_v2()
	*/
	esp_phy_enable(PHY_MODEM_BT);
	s_lp_stat.phy_enabled = 1;

#if CONFIG_SW_COEXIST_ENABLE
	coex_enable();
#endif

	// enable low power mode
	do {
#if CONFIG_MAC_BB_PD
		if (esp_register_mac_bb_pd_callback(btdm_mac_bb_power_down_cb) != 0) {
			ret = ESP_ERR_INVALID_ARG;
			goto error;
		}

		if (esp_register_mac_bb_pu_callback(btdm_mac_bb_power_up_cb) != 0) {
			ret = ESP_ERR_INVALID_ARG;
			goto error;
		}
#endif

		if (s_lp_cntl.enable) {
			btdm_controller_enable_sleep(true);
		}
	} while (0);

	// Disable pll track by default in BLE controller on ESP32-C3 and ESP32-S3
	sdk_config_extend_set_pll_track(false);

	if (btdm_controller_enable(mode) != 0) {
		ret = ESP_ERR_INVALID_STATE;
		goto error;
	}

	coex_pti_v2();

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;

	return ret;

error:
	// disable low power mode
	do {
#if CONFIG_MAC_BB_PD
		esp_unregister_mac_bb_pd_callback(btdm_mac_bb_power_down_cb);
		esp_unregister_mac_bb_pu_callback(btdm_mac_bb_power_up_cb);
#endif
		btdm_controller_enable_sleep(false);
	} while (0);

#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif
	if (s_lp_stat.phy_enabled) {
		esp_phy_disable(PHY_MODEM_BT);
		s_lp_stat.phy_enabled = 0;
	}
	return ret;
}

esp_err_t esp_bt_controller_disable(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_ERR_INVALID_STATE;
	}

	async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_DISA);
	while (!btdm_power_state_active()){}
	btdm_controller_disable();

	async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_DISA);

#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif
	if (s_lp_stat.phy_enabled) {
		esp_phy_disable(PHY_MODEM_BT);
		s_lp_stat.phy_enabled = 0;
	}

	btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

	// disable low power mode
	do {
#if CONFIG_MAC_BB_PD
		esp_unregister_mac_bb_pd_callback(btdm_mac_bb_power_down_cb);
		esp_unregister_mac_bb_pu_callback(btdm_mac_bb_power_up_cb);
#endif
	} while (0);

	return ESP_OK;
}

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
	return btdm_controller_status;
}

static int enh_power_type_get(esp_ble_power_type_t power_type)
{
	switch (power_type) {
	case ESP_BLE_PWR_TYPE_ADV:
		return ESP_BLE_ENHANCED_PWR_TYPE_ADV;
	case ESP_BLE_PWR_TYPE_SCAN:
		return ESP_BLE_ENHANCED_PWR_TYPE_SCAN;
	case ESP_BLE_PWR_TYPE_CONN_HDL0:
	case ESP_BLE_PWR_TYPE_CONN_HDL1:
	case ESP_BLE_PWR_TYPE_CONN_HDL2:
	case ESP_BLE_PWR_TYPE_CONN_HDL3:
	case ESP_BLE_PWR_TYPE_CONN_HDL4:
	case ESP_BLE_PWR_TYPE_CONN_HDL5:
	case ESP_BLE_PWR_TYPE_CONN_HDL6:
	case ESP_BLE_PWR_TYPE_CONN_HDL7:
	case ESP_BLE_PWR_TYPE_CONN_HDL8:
		return ESP_BLE_ENHANCED_PWR_TYPE_CONN;
	case ESP_BLE_PWR_TYPE_DEFAULT:
		return ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT;
	default:
		break;
	}

	return power_type;
}

