zephyrproject-rtos/hal_espressif/zephyr/esp32s3/src/bt/esp_bt_adapter.c
/* extra functions */
esp_err_t esp_ble_tx_power_set(esp_ble_power_type_t power_type, esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;
	uint16_t handle = BLE_PWR_HDL_INVL;
	int enh_pwr_type = enh_power_type_get(power_type);

	if (power_type > ESP_BLE_PWR_TYPE_DEFAULT) {
		return ESP_ERR_NOT_SUPPORTED;
	}

	if (enh_pwr_type == ESP_BLE_ENHANCED_PWR_TYPE_CONN) {
		handle = power_type;
	}

	if (ble_txpwr_set(enh_pwr_type, handle, power_level) == 0) {
		stat = ESP_OK;
	}

	return stat;
}

esp_power_level_t esp_ble_tx_power_get(esp_ble_power_type_t power_type)
{
	esp_power_level_t lvl;
	uint16_t handle = BLE_PWR_HDL_INVL;
	int enh_pwr_type = enh_power_type_get(power_type);

	if (power_type > ESP_BLE_PWR_TYPE_DEFAULT) {
		return ESP_PWR_LVL_INVALID;
	}

	if (enh_pwr_type == ESP_BLE_ENHANCED_PWR_TYPE_CONN) {
		handle = power_type;
	}

	lvl = (esp_power_level_t)ble_txpwr_get(enh_pwr_type, handle);

	return lvl;
}

esp_err_t esp_ble_tx_power_set_enhanced(esp_ble_enhanced_power_type_t power_type, uint16_t handle,
                                        esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;

	switch (power_type) {
	case ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT:
	case ESP_BLE_ENHANCED_PWR_TYPE_SCAN:
	case ESP_BLE_ENHANCED_PWR_TYPE_INIT:
		if (ble_txpwr_set(power_type, BLE_PWR_HDL_INVL, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_ADV:
	case ESP_BLE_ENHANCED_PWR_TYPE_CONN:
		if (ble_txpwr_set(power_type, handle, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	default:
		stat = ESP_ERR_NOT_SUPPORTED;
		break;
	}

	return stat;
}

esp_power_level_t esp_ble_tx_power_get_enhanced(esp_ble_enhanced_power_type_t power_type,
                                                uint16_t handle)
{
	int tx_level = 0;

	switch (power_type) {
	case ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT:
	case ESP_BLE_ENHANCED_PWR_TYPE_SCAN:
	case ESP_BLE_ENHANCED_PWR_TYPE_INIT:
		tx_level = ble_txpwr_get(power_type, BLE_PWR_HDL_INVL);
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_ADV:
	case ESP_BLE_ENHANCED_PWR_TYPE_CONN:
		tx_level = ble_txpwr_get(power_type, handle);
		break;
	default:
		return ESP_PWR_LVL_INVALID;
	}

	return (esp_power_level_t)tx_level;
}

esp_err_t esp_bt_sleep_enable (void)
{
	esp_err_t status;
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_ERR_INVALID_STATE;
	}
	if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1) {
		btdm_controller_enable_sleep (true);
		status = ESP_OK;
	} else {
		status = ESP_ERR_NOT_SUPPORTED;
	}

	return status;
}

esp_err_t esp_bt_sleep_disable (void)
{
	esp_err_t status;
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED) {
		return ESP_ERR_INVALID_STATE;
	}
	if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1) {
		btdm_controller_enable_sleep (false);
		status = ESP_OK;
	} else {
		status = ESP_ERR_NOT_SUPPORTED;
	}

	return status;
}

bool esp_bt_controller_is_sleeping(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED ||
			btdm_controller_get_sleep_mode() != ESP_BT_SLEEP_MODE_1) {
			return false;
	}

	return !btdm_power_state_active();
}

void esp_bt_controller_wakeup_request(void)
{
	if (btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED ||
			btdm_controller_get_sleep_mode() != ESP_BT_SLEEP_MODE_1) {
			return;
	}

	btdm_wakeup_request();
}

int IRAM_ATTR esp_bt_h4tl_eif_io_event_notify(int event)
{
	return btdm_hci_tl_io_event_post(event);
}

static void coex_wifi_sleep_set_hook(bool sleep)
{

}

static void esp_bt_free(void *mem)
{
	esp_bt_free_func(mem);
}

static uint32_t coex_schm_interval_get_wrapper(void)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_interval_get();
#else
	return 0;
#endif
}

static uint8_t coex_schm_curr_period_get_wrapper(void)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_curr_period_get();
#else
	return 1;
#endif
}

static void * coex_schm_curr_phase_get_wrapper(void)
{
#if CONFIG_SW_COEXIST_ENABLE
	return coex_schm_curr_phase_get();
#else
	return NULL;
#endif
}
